// studentData.js
const allStudents = {
    "126": [
        { 
            id: "126001", 
            name: "นายก้องภพ ชาญชำนิ", 
            nickname: "ก้อง", 
            number: "68909",
            birthday: "4 ตุลาคม 2550",
            room: "6/2", 
            img: "1685279739726.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5938.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะก้องถ้าเราทำอะไรผิดไปหรือทำให้ไม่พอใจเราขอโทษจริงนะ เราก็พยายามช่วยแกตลอดนะบางครั้งเห็นแกอยู่กับสภาเลยอยากให้โฟกัสงานสภาแบบเต็มที่เรารักแกเสมอนะก้อง ขอให้ชีวิตมีความสุขกับมหาลัยที่เลือกนะโชคดีเว้ย" 
        },
        { 
            id: "126002", 
            name: "นายกันตพงศ์ ไตรธรรม", 
            nickname: "กันต์", 
            number: "68910",
            birthday: "21 ธันวาคม 2550",
            room: "6/2", 
            img: "IMG_9566.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5776.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะกันต์ถึงแม่ว่าเราจะมาจากโรงเรียนเดียวกันตอนม.ต้นแต่เราก็ไม่รู้จักแกเลยตอนแรกคิดว่าแกเป็นคนปกติแต่ไม่เลย555 เรามีความสุขนะที่เห็นแกสนุกร่าเริงแต่พอแกจริงจังก็ดีไปอีกแบบแกเป็นคนที่เรียนเก่งมากเรายอมรับเลย แล้วเราจะไปสายเดียวกันอีกก็แอบแปลกใจนะแต่ก็รู้สึกดีที่มีคนมีเส้นทางเหมือนกันขอให้แกสู้ๆนะกับเส้นทางนี้ หวังว่าเราจะได้เจอกันที่หมาลัยเดียวกันนะ(เหยียดให้เบาๆลงหน่อยนะ555)" 
        },
        { 
            id: "126003", 
            name: "นายณปวร ชังภัย", 
            nickname: "ปราชญ์", 
            number: "68912",
            birthday: "15 ตุลาคม 2550",
            room: "6/2", 
            img: "IMG_9814.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5779.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะปราชญ์เราเป็นเพื่อนกันตั้งแต่ม.1 แล้วเราเห็นแกนิ่งๆมาตลอดเลยเราอยากให้แกไปสนุกกับเพื่อนบาง เราดีใจนะที่แกไปพูลวิลล่าด้วยหวังว่าเราจะไปเที่ยวสนุกด้วยกันนะ" 
        },
        { 
            id: "126004", 
            name: "นายธนกร ทีนาคะ", 
            nickname: "กร", 
            number: "68913",
            birthday: "10 ธันวาคม 2550",
            room: "6/2", 
            img: "IMG_9600.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5782.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะกรเรามีความสุขมากที่ได้อยู่กับแกนะ แกเป็นคนที่คอยสร้างความสนุกให้คนในห้องถึงแม้ว่าเราจะเพิ่งเริ่มสนิทกันตอนม.6แต่เราก็สนุกมากเลย แถมแกยังเรียนเก่งด้วยและเป็นคนที่ไม่ยอมแพ้แต่หลังจากนี้ก็สู้ๆนะทำให้เต็มที่ที่สุดเอามหาลัยที่หวังให้ได้ แล้วซักวันหนึ่งเรามาเจอกันนะ(เดี๋ยวเลี้ยงเหล้าเอง555)" 
        },
        { 
            id: "126005", 
            name: "นายปุณณวิช กานต์นวดี", 
            nickname: "เอิร์ธ", 
            number: "68914",
            birthday: "8 พฤศจิกายน 2550",
            room: "6/2", 
            img: "IMG_9569.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5789.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะเอิร์ธถึงแม้ว่าบ้านเราจะอยู่ห่างกันไม่ไกลแต่เราก็ไม่ค่อยได้คุยกันเลย เราก็ยังสนิทกันอยู่มั้ง แต่ก็ขอบคุณจริงๆที่เป็นเพื่อนกันตลอดมาและขอให้ได้เข้ามหาลัยที่หวังไว้นะหวังว่าในอนาคตเราจะได้เจอกันอีกนะ" 
        },
        { 
            id: "126006", 
            name: "นายอธิ อัครกาญจน์กิจ", 
            nickname: "เต้", 
            number: "68915",
            birthday: "19 กุมภาพันธ์ 2551",
            room: "6/2", 
            img: "IMG_9805 (1).JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5792.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะเต้ถึงแม้ว่าเราจะไม่ค่อยสนิทกันแต่เวลาที่เราได้อยู่กับแกเรามีความสุขนะแกเป็นคนคอยสร้างรอยยิ้มภายในกลุ่มแล้วเป็นคนที่เรียนเก่งอีกด้วย เราหวังว่าแกจะเข้ามหาลัยที่ตัวเองหวังนะ" 
        },
        { 
            id: "126007", 
            name: "นางสาวณัชชา อินทา", 
            nickname: "ขวัญ", 
            number: "68916",
            birthday: "6 ธันวาคม 2550",
            room: "6/2", 
            img: "IMG_9579.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5798.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะขวัญถึงแม้ว่าเราจะไม่ค่อยได้คุยกับแกเลยแต่แกเป็นคนที่เรียนเก่งมาก เราขอให้แกได้หมาลัยที่ตัวเองหวังนะไว้เจอกันใหม่นะ" 
        },
        { 
            id: "126008", 
            name: "นางสาวธนพร สังข์วงค์", 
            nickname: "กวาง", 
            number: "68917",
            birthday: "11 มิถุนายน 2550",
            room: "6/2", 
            img: "IMG_9830.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5801.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะกวางขอบคุณมากที่ค่อยช่วยเหลือห้องเราเสมอมากวางเป็นคนที่น่ารักมากและดีสุดๆ กวางเป็นคนที่คอยสร้างความร่าเริงให้ห้องเราเสมอมาเราหวังว่ากวางจะได้เป็นครูตามที่กวางหวังไว้นะ สู้ๆ นะเราคอยเป็นกำลังใจให้อยู่จบไปแล้วอย่าลืมกันนะไว้เจอกันใหม่นะกวาง" 
        },
        { 
            id: "126009", 
            name: "นางสาวนภัสนันท์ คิดถูก", 
            nickname: "ณภัทร", 
            number: "68918",
            birthday: "12 กุมภาพันธ์ 2551",
            room: "6/2", 
            img: "IMG_9818 (1).JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5805.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะคุณย่า555 ขอบคุณที่สร้างความตลกให้ห้องนะ ณภัทรเป็นคนที่เรียนเก่งมากแล้วตลกด้วยมีอะไรก็ทำให้ตลกได้ตลอด หวังว่ามหาลัยที่ณภัทรเข้าไปจะเจอแต่คนดีๆและเข้ากับณภัทรได้นะ หวังว่าเราจะเจอกันอีกในอนาคตนะ" 
        },
        { 
            id: "126010", 
            name: "นางสาวนริชยา ชินนะ", 
            nickname: "อิ๊ง", 
            number: "68919",
            birthday: "11 พฤษภาคม 2551",
            room: "6/2", 
            img: "IMG_9601.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5811.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะอิ๊งขอบคุณมากเลยที่เป็นหัวหน้าห้องตลอด 3 ปีที่ผ่านมา แกทำหน้าที่ได้ดีจริงๆและเป็นที่รักของเพื่อนๆในห้องด้วยเรานับถือแกมากกับทุกสิ่งที่แกทำตลอด 3 ปีที่ผ่านมาเรายอมรับเลยว่าแกเก่งมาก เรายินดีนะที่ได้เป็นเพื่อนกันเรามีความสุขมากที่ได้อยู่ด้วยกัน แกเป็นคนที่คอยสร้างเสียงหัวเราะให้ห้องเราและเป็นตัวแทนในโอกาสต่างๆขอบคุณนะ หวังว่าแกจะได้เข้ามหาลัยที่ตัวเองหวังไว้และหวังว่าเราคงจะได้เจอกันอีกนะ" 
        },
        { 
            id: "126011", 
            name: "นางสาวปวีร์ณัฏฐ์ เจริญสลุง", 
            nickname: "แพน", 
            number: "68920",
            birthday: "13 พฤษภาคม 2551",
            room: "6/2", 
            img: "FB_IMG_1685360256632.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5816.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะแพนถึงแม้ว่าเราจะไม่ค่อยได้คุยกันก็ตามแต่เราก็ยังได้ร่วมงานกันอยู่บ้าง แกเป็นคนที่เรียนเก่งนะและเป็นคนที่ทำงานได้ดีมากด้วย เราขอให้แกได้มหาลัยที่ตัวเองหวังไว้นะหวังว่าเราจะได้เจอกันอีกนะ" 
        },
        { 
            id: "126012", 
            name: "นางสาวปาณิศา อมรประสิทธิ์", 
            nickname: "ฟ้าใส", 
            number: "68921",
            birthday: "5 กรกฎาคม 2550",
            room: "6/2", 
            img: "IMG_9578.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5822.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะฟ้าใสขอบคุณที่เป็นความสดใสของเราในช่วงหนึ่งแต่เราก็มีความสุขมากที่ได้เป็นเพื่อนกันนะ เราขอให้ฟ้าใสเข้ามหาลัยที่ตัวเองอยากเข้าได้สำเร็จแล้ว เราหวังว่าเราจะได้เจอกันอีกนะ" 
        },
        { 
            id: "126013", 
            name: "นางสาวเปมิกา ไชยรัตน์", 
            nickname: "ปาย", 
            number: "68922",
            birthday: "7 สิงหาคม 2551",
            room: "6/2", 
            img: "IMG_9821.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5823.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะปายเราดีใจนะที่มีแกเป็นเพื่อนเรามีความสุขมากเลย แกเป็นคนที่ร่าเริงนะแต่ช่วยเบาเสียงหน่อยได้ไหมแกพูดเสียงดังมากเราตกใจนะที่แกอยู่ตรงโรงพลยาบาลบ้านแพรกอ่่ะ เราไม่คิดเลยว่าเราจะอยู่แถวเดียวกันแต่แกเป็นคนที่เรียนเก่งนะ เราหวังว่าแกจะได้เข้ามหาลัยที่ตัวเองหวังไว้แล้ววันหน้าาเรามาเจอกันใหม่นะ" 
        },
        { 
            id: "126014", 
            name: "นางสาวพรนภา คุ้มภัย", 
            nickname: "เน็กซ์", 
            number: "68923",
            birthday: "8 มีนาคม 2551",
            room: "6/2", 
            img: "IMG_9557.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5827.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะเน็กซ์ถึงแม้ว่าเราจะไม่ค่อยได้คุยกันเลยแตเราก็ยินดีนะที่ได้มาเป็นเพื่อนกับเน็กซ์ เราเห็นเน็กซ์ทำหลายงานมากแล้วเน็กซ์ทำได้ดีมากเรานับถือเลยที่เน็กซ์ทำหลายงานได้ออกมาดีขนาดนี้ หลังจากนี้ขอให้ใช้ชีวิตในมหาลัยให้มีความสุขนะสมหวังทุกประการ" 
        },
        { 
            id: "126015", 
            name: "นางสาวอัครสุดา จันทราสา", 
            nickname: "อิงอิน", 
            number: "68925",
            birthday: "9 กรกฎาคม 2550",
            room: "6/2", 
            img: "IMG_9842 (1).JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5835.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะอิงอินเราไม่ค่อยได้คุยกันเลยนอกจากเรื่องงาน เรามองว่าอิงอินเป็นคนที่เรียนเก่งนะได้แฟนดีด้วยแหละ ก็ขอให้ชีวิตในอนาคตราบรื่นนะทำอะไรก็ให้เจอแต่สิ่งดีๆไว้เจอกันใหม่นะ" 
        },
        { 
            id: "126016", 
            name: "นายชยุต บุญชัยมาตย์", 
            nickname: "ต้นกล้า", 
            number: "68927",
            birthday: "23 กันยายน 2550",
            room: "6/2", 
            img: "IMG_9567.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5842.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะต้นกล้าเราเป็นเพื่อนกันมาตั้งนานเราขอบคุณตลอดมาเลยนะที่คอยช่วยเหลือเราคอยเป็นเพื่อนเราคอยเป็นทุกอย่างให้เราเรามีความสุขมากที่ได้อยู่กับต้นกล้านะ ที่เราสนิทกันก็น่าจะชอบอะไรคล้ายๆกันด้วยแหละที่ทำให้เราสนิทกันได้ หลังจากนี้เราขอให้ต้นกล้าเจอแต่สิ่งที่ดีๆได้เพื่อนใหม่ที่ดีๆทำอะไรก็ดีไปทุกอย่างโชคดีกับมหาลัยนะต้นกล้าเราจะไม่ลืมแกเลยรักมากๆ" 
        },
        { 
            id: "126017", 
            name: "นายณัฐภัทร ประเทือง", 
            nickname: "นัท", 
            number: "68928",
            birthday: "12 พฤศจิกายน 2550",
            room: "6/2", 
            img: "IMG_9832.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5846.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะนัทถึงแม้ว่าเราจะมาเริ่มสนิทกันตอนม.6แต่เราก็รู้สึกดีนะที่ได้อยู่กับแก เราได้พูดคุยแลกเปลี่ยนอะไรกันสนุกด้วยกันกินข้าวด้วยกันเราสนุกมากจริง เราขอให้ชีวิตข้างหน้าของแกมีแต่เรื่องดีๆนะไว้เรามาเจอกันอีกในอนาคตนะ" 
        },
        { 
            id: "126018", 
            name: "นายธนธัส คชเดช", 
            nickname: "ปอ", 
            number: "68929",
            birthday: "10 สิงหาคม 2550",
            room: "6/2", 
            img: "1685279954282.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5853.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะปอเรามาสนิทกันตอนไหนนะ555จำไม่ได้ละแต่เราเข้ากันดีมากในหลายๆเรื่องเรามีความสุขนะที่ได้อยู่กับแก เราไม่เคยคิดเลยว่าเราจะปล่อยตัวตนเราได้มากขนาดนี้ขอบคุณมากๆนะ จบกันไปแล้วขอให้ชีวิตมีแต่เรื่องดีๆในชีวิตนะโชคดีกับทางที่เลือกเดินนะ" 
        },
        { 
            id: "126019", 
            name: "นายปัณณวัฒน์ บัวเล็ก", 
            nickname: "แดน", 
            number: "68930",
            birthday: "5 กันยายน 2550",
            room: "6/2", 
            img: "IMG_9815.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5855.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะแดนถึงเราจะนั่งข้างกันแต่ก็ไม่ค่อยได้คุยกันเลยด้วยความที่ว่าแนวเกมเราอาจจะไม่คล้ายกันด้วยเราถึงไม่ค่อยได้คุยกันแต่เราก็มีความสุขนะที่มีแกในตลอด 3 ปีที่ผ่านมา แกเป็นเพื่อนข้างโต๊ะที่ดีมาก เราหวังว่าแกจะสมหวังในทางที่ตัวเองเลือกไว้นะแล้ววันหน้าเรามาเจอกันอีกนะ" 
        },
        { 
            id: "126020", 
            name: "นายพศวีร์ คล้ายจันทร์", 
            nickname: "วี", 
            number: "68931",
            birthday: "4 กันยายน 2551",
            room: "6/2", 
            img: "IMG_9813.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5860.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะวีเราไม่ค่อยได้คุยกันเลยขอโทษนะที่ล้อไปอ่ะหวังว่าจะไม่โกรธกันนะ เราเห็นแกใช้ชีวิตอย่างมีความสุขเราก็มีความสุขแล้ว แกเรียนอังกฤษเก่งมากเรายอมรับเลยขอบคุณนะที่เป็นเพื่อนกันมา ขอให้ชีวิตในมหาลัยที่เลือกมีแต่เรื่องดีขอให้ไม่โดนล้อว่าดำนะ" 
        },
        { 
            id: "126021", 
            name: "นายพิชญะ ถุงเงิน", 
            nickname: "โอชิ", 
            number: "68932",
            birthday: "27 พฤศจิกายน 2550",
            room: "6/2", 
            img: "PC151210.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5864.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะโอชิเราชอบที่โอชิหัวเราะได้ขำกับเพื่อนๆนะทุกครั้งเราก็ยิ้มตลอดเลยขอบคุณนะที่ทำให้ชีวิตเราสดใสขึ้น แล้วก็โอชิเล่นบาสเก่งมากแอบปลื้ม แล้วก็ยินดีด้วยนะที่ติด สจล ขอให้ชีวิตในมหาลัยมีแต่เรื่องดีๆนะได้เจอเพื่อนดีๆสังคมดีๆที่ทำให้โอชิยิ้มได้นะ" 
        },
        { 
            id: "126022", 
            name: "นายศุภณัฐ ลาโม้", 
            nickname: "เวกเตอร์,พี,พีพี", 
            number: "68933",
            birthday: "17 กรกฏาคม 2550",
            room: "6/2", 
            img: "IMG_9595.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5868.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะพีตลอด3ปีที่ผ่านเราเข้าใจแกนะที่แกทำไปทุกอย่างอ่ะเราขอโทษนะที่ล้อแก แล้วก็ขอบคุณนะที่คอยให้คำปรึกษาเรื่องต่างๆ เราขอให้แกเจอแต่เพื่อนดีๆสังคมดีๆใช้ชีวิตให้มีความสุข(คืนตังค์กูด้วย)" 
        },
        { 
            id: "126023", 
            name: "นายสุภกิณห์ ทองคง", 
            nickname: "คอปเตอร์", 
            number: "68934",
            birthday: "22 พฤษภาคม 2551",
            room: "6/2", 
            img: "IMG_9589.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5875.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะคอปแกเป็นเพื่อนที่เราสนิทด้วยมากที่สุดเลย เราขอบคุณจริงๆนะที่คอยอยุ่ข้างเราเสมอมาในหลายๆเรื่อง เราอาจจะเข้ากันได้หรือไม่ได้เราก็ยังสนิทกันอยู่เสมอ หลังจากนี้เราขอให้แกมีแต่ความสุขไปเป็นครูแล้วก็อย่าลืมกันนะว่าเรายังแค่เป็นเพื่อนสนิทกันมาก่อนหวังว่าเราจะเจอกันอีกนะรักมึงเสมอเว้ยเพื่อนรัก" 
        },
        { 
            id: "126024", 
            name: "นายอภิวัชร์ สุขะเต", 
            nickname: "ณัฎฐ์", 
            number: "68935",
            birthday: "25 ตุลาคม 2550",
            room: "6/2", 
            img: "IMG_9554.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5876.jpg",
            msg: "ถึงรุ่น126 ขอบคุณที่ทุกคนได้มารวมกันที่ห้อง 2 ของเราห้องเราเป็นห้องที่ดีมากห้องหนึ่งเลยที่มีคนหลายประเภทอยู่ด้วยกัน แต่เราก็สามัคคีกันมากไม่ว่าจะมีเหตุการณ์อะไรก็ตามห้องเราก็จะผ่านมันไปได้เสมอ ทุกคนเป็นคนที่เก่งในแบบของตัวเองไม่มีใครผิดใครถูกแต่เราก็มารวมกันเป็นห้อง 2 ได้ถึงแม้ว่าเราอาจจะทะเลาะกันบ้างโกรธกันบ้างแต่เราก็ยังสามารถอยู่ด้วยกันได้อย่างมีความสุข ในตอนนี้ที่ทุกคนได้จบจากรั้วพิบูลวิทยาลัยแล้วแต่เรายังคงเป็นเพื่อนกันอยู่ถึงแม้ว่าเราจะห่างกันไปไกลแค่ไหนเราก็ยังเป็นเพื่อนกันเสมอ ไว้ซักวันหนึ่งเราคงจะได้กลับมารวมตัวกันอีกครั้งซํกวันหนึ่งก็ขอให้ทุกคนโชคดีกับเส้นทางชีวิตที่ตัวเองเลือกไปไว้เจอกันนะพิบูลวิทยาลัยรุ่น126/2(ทุกคนมีพื้นที่เป็นของตัวเองแต่ก็อย่าลืมว่าเราจะต้องอยู่ร่วมกับคนอื่นดังนั้นเราควรที่จะดูบริบทรอบข้างว่ามันเป็นยังไงควรทำอะไรเราถึงจะอยู่กับทุกคนอย่างมีความสุขด้วยรักจากนัทแว่น)" 
        },
        { 
            id: "126025", 
            name: "นางสาวจิรปรียา สิงห์ทา", 
            nickname: "น้ำขิง", 
            number: "68936",
            birthday: "15 พฤษภาคม 2550",
            room: "6/2", 
            img: "IMG_9555.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5883.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะน้ำขิงถึงแม้ว่าเราจะไม่ค่อยได้คุยกันเลยแต่เราคิดว่าแกเรียนเก่งมากและทำงานได้ดีสุดๆ หลังจากจบม.ปลายแล้วของให้เจอแต่เรื่องดีๆในมหาลัยนะเจอแต่เพื่อนดีๆสังคมดีๆใช้ชีวิตให้มีความสุขไว้เจอกันอีกนะ" 
        },
        { 
            id: "126026", 
            name: "นางสาวชนัญชิดา จิตรีฉาย", 
            nickname: "พีค", 
            number: "68937",
            birthday: "7 กันยายน 2550",
            room: "6/2", 
            img: "IMG_9835.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5891.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะพีคเราขอโทษนะที่ล้อหลายๆเรื่องแต่กูไม่แคร์ ขอบคุณนะที่คอยสร้างความสุขความร่าเริงให้ห้องเราเสมอมารวมถึงเราด้วย หลังจากนี้ขอให้มีแต่ความโชคดีในชีวิตนะเจอเพื่อนดีๆสังคมดีๆไว้เรามาเจอกันอีกนะ" 
        },
        { 
            id: "126027", 
            name: "นางสาวณพัฐอร สุขขี", 
            nickname: "ใบข้าว", 
            number: "68938",
            birthday: "5 สิงหาคม 2550",
            room: "6/2", 
            img: "IMG_9827.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5901.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะใบข้าวถึงแม้ว่าเราจะไม่ค่อยได้คุยกันเลยแต่เราคิดว่าแกเรียนเก่งมากและทำงานได้ดีสุดๆ หลังจากจบม.ปลายแล้วของให้เจอแต่เรื่องดีๆในมหาลัยนะเจอแต่เพื่อนดีๆสังคมดีๆใช้ชีวิตให้มีความสุขไว้เจอกันอีกนะ" 
        },
        { 
            id: "126028", 
            name: "นางสาวธนารีย์ พรมมิ", 
            nickname: "ของขวัญ", 
            number: "68939",
            birthday: "7 พฤษภาคม 2551",
            room: "6/2", 
            img: "IMG_9841.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5902.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะของขวัญขอบคุณที่มาเป็นความสดใสความตลกตลอดมานะ เรามีความสุขมากที่ได้มีแกเป็นเพื่อนเรายินดีด้วยนะที่ได้ สจล แล้วขอให้ชีวิตหลังจากนี้มีความสุขมากๆนะขอให้ไม่เจออุปสรรคใดๆมาขัดขวางแกได้เลยโชคดีนะของขวัญหวังว่าเราจะได้เจอกันใหม่นะ" 
        },
        { 
            id: "126029", 
            name: "นางสาวนรีกานต์ เกื้อกูล", 
            nickname: "น้ำริน", 
            number: "68940",
            birthday: "8 มีนาคม 2551",
            room: "6/2", 
            img: "1685690289193(1).jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5908.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะน้ำรินเราไม่ค่อยได้คุยกันเลยแต่น้ำรินเป็นคนที่เรียนเก่งนะและน้ำรินเวลาทำอะไรหลายๆอย่างแล้วทำได้ดีมากเราชื่นชมเลย เราเห็นน้ำรินเป็นไอดอลนะ หลังจากจบม.ปลายแล้วเราขอให้น้ำรินเจอแต่สิ่งดีๆเพื่อนและสังคมที่ดีๆนะแล้วเราไว้มาเจอกันใหม่ในอนาคตนะ" 
        },
        { 
            id: "126030", 
            name: "นางสาวพลอยชมพู เลิศวิลัย", 
            nickname: "อิ๊ม", 
            number: "68941",
            birthday: "25 กันยายน 2550",
            room: "6/2", 
            img: "IMG_9844 (1).JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5916.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะอิ๊มแกเป็นเด็กเก่งประจำห้องเลย แล้วก็ได้มหาลัยก่อนเพื่อนด้วยยินดีด้วยนะเราไม่ได้คุยกันเลยแต่เราก็ดีใจนะที่ได้เป็นเพื่อนร่วมห้องกับอิ๊มจบม.ปลายไปแล้วอย่าลืมกันนะ เราขอให้ให้อิ๊มเจอแต่สิ่งดีๆในชีวิตนะไว้เจอกันใหม่นะ" 
        },
        { 
            id: "126031", 
            name: "นางสาวแพรแก้ว อัฐมาลา", 
            nickname: "แพรแก้ว", 
            number: "68942",
            birthday: "25 ตุลาคม 2550",
            room: "6/2", 
            img: "IMG_9592.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5922.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะแพรแก้วตอนแรกเราไม่รู้ว่าแกเกิดวันเดียวกับเราเราตกใจมากเลยนะที่เราเกิดวันเดียวกัน ตลอด3ปีแกเป็นเพื่อนที่ดีมากเลยนะสำหรับเราแกเป็นคนที่ร่าเริงอยู่ด้วยแล้วสนุกตลอดมา เรามีความสุขมากเห็นแกได้มหาลัยแล้วก็ดีใจด้วยนะ ขอให้แกเจอแต่เรื่องดีๆในชีวิตนะแล้วเรามาเจอกันใหม่นะเพื่อนที่ดีที่สุด" 
        },
        { 
            id: "126032", 
            name: "นางสาวศรุตา เย็นจิตร์", 
            nickname: "ไนท์", 
            number: "68943",
            birthday: "23 กุมภาพันธ์ 2551",
            room: "6/2", 
            img: "IMG_9581.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5928.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะไนท์เรามีความสุขมากเลยที่มีไนท์เป็นเพื่อน ขอบคุณนะที่คอยนึกถีงเราเสมอในเรื่องต่างๆขอบคุณจริงๆ เราได้ทำงานด้วยกันบ่อยมากเราอาจจะมีบ้างอย่างที่คล้ายกันอยู่ก็ได้นะ ไนท์เป็นคนที่ร่าเริงตลอดเวลาเวลาที่อยู่ด้วยแล้วมีความสุขมากเวลาจริงจังก็ตั้งใจจริงๆ แล้วไนท์ก็เป็นคนที่เรียนเก่งมากคนนึงเลย เรามีความสุขมากเลยที่มีไนท์เป็นเพื่อนในตลอด3ปีที่ผ่านมาหลังจากนี้เราขอให้ไนท์ร่าเริงแบบนี้ต่อไปเรื่อยๆนะขอให้ไนท์เจอแต่คนที่ดีๆสังคมดีๆและขอให้ไนท์โชคดีกับสิ่งที่จะทำในอนาคตไว้เรามาเจอกันใหม่นะถึงตอนนั้นอย่าลืมกันละรักนะ" 
        },
        { 
            id: "126033", 
            name: "นางสาวสาริศา ผ่องอักษร", 
            nickname: "อะตอม", 
            number: "68944",
            birthday: "8 พฤศจิกายน 2550",
            room: "6/2", 
            img: "IMG_9562.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: "TAE_5936.jpg",
            msg: "ขอบคุณสำหรับ 3 ปีที่ผ่านมานะอะตอมถึงแม้ว่าเราจะไม่ค่อยได้คุยกันเลยแต่เราคิดว่าแกเรียนเก่งมากและทำงานได้ดีสุดๆ หลังจากจบม.ปลายแล้วของให้เจอแต่เรื่องดีๆในมหาลัยนะเจอแต่เพื่อนดีๆสังคมดีๆใช้ชีวิตให้มีความสุขไว้เจอกันอีกนะ" 
        },
        
        // เพิ่มคนอื่นๆ ต่อไป...
    ],
    "127": [
        { 
            id: "127001", 
            name: "นางสาวภาพตะวัน นาคสกุล", 
            nickname: "ฟูจิ", 
            number: "68924",
            birthday: "7 สิงหาคม 2550",
            room: "5/2", 
            img: "IMG_9585.JPG", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127002", 
            name: "นายนราวิชญ์ ถาวร", 
            nickname: "นาโน", 
            number: "69941",
            birthday: " ",
            room: "5/2", 
            img: "1717150026576.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127003", 
            name: "นายปัญญา มังกรศักดิ์สิทธิ์", 
            nickname: "นะโม", 
            number: "69942",
            birthday: " ",
            room: "5/2", 
            img: "1717150024883.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127004", 
            name: "นายปุณยวัจน์ ธรรมานนท์", 
            nickname: "ปันปัน", 
            number: "69943",
            birthday: " ",
            room: "5/2", 
            img: "1717150021491.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127005", 
            name: "นายพงศ์ภรณ์ สิริโสภณวัฒนา", 
            nickname: "ปัน", 
            number: "69944",
            birthday: " ",
            room: "5/2", 
            img: "1716207724240.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127006", 
            name: "นายพิชชพัชร แตงสกุล", 
            nickname: "มีคุณ", 
            number: "69945",
            birthday: " ",
            room: "5/2", 
            img: "1717150019816.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127007", 
            name: "นายรัชชานนท์ ประแดงปุย", 
            nickname: "นนท์", 
            number: "69947",
            birthday: " ",
            room: "5/2", 
            img: "1717150034910.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127008", 
            name: "นายวชิรพงษ์ โพธิ์รัตนมณี", 
            nickname: "เพชร", 
            number: "69948",
            birthday: " ",
            room: "5/2", 
            img: "1717150038467.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127009", 
            name: "นายสิริกร โชคธนธรณ์", 
            nickname: "ภูมิ", 
            number: "69949",
            birthday: " ",
            room: "5/2", 
            img: "1717150041128.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127010", 
            name: "นายเอกศิษฎ์ ไพรดำ", 
            nickname: "พีค", 
            number: "69950",
            birthday: " ",
            room: "5/2", 
            img: "1717150045865.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127011", 
            name: "นางสาวกรกมล ก้องเวหา", 
            nickname: "น้ำอิง", 
            number: "69951",
            birthday: "1 ธันวาคม 2551",
            room: "5/2", 
            img: "1717150022328.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127012", 
            name: "นางสาวชนัญนิตฎ์ รัตนศิริพงษา", 
            nickname: "กั้ง", 
            number: "69952",
            birthday: " ",
            room: "5/2", 
            img: "1717150028245.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127013", 
            name: "นางสาวณัฐกฤตา เครือน้ำคำ", 
            nickname: "เปียโน", 
            number: "69953",
            birthday: " ",
            room: "5/2", 
            img: "1717150044026.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127014", 
            name: "นางสาวปรินทร สายธนู", 
            nickname: "ปิ่น", 
            number: "69954",
            birthday: " ",
            room: "5/2", 
            img: "1717150042858.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127015", 
            name: "นางสาวภิญญาพัชญ์ เสือครุฑ", 
            nickname: "พราวด์", 
            number: "69955",
            birthday: " ",
            room: "5/2", 
            img: "1717150039263.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127016", 
            name: "นางสาวศิรดา ลาวัลย์", 
            nickname: "ไอติม", 
            number: "69956",
            birthday: "4 มิถุนายน 2551",
            room: "5/2", 
            img: "1717150040125.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127017", 
            name: "นายกฤชกุชกร อุกอาจ", 
            nickname: "ตี้", 
            number: "69957",
            birthday: " ",
            room: "5/2", 
            img: "1717150035761.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127018", 
            name: "นายกฤตย์ธีป์ เล็กเจริญวงศ์", 
            nickname: "โปรตอน", 
            number: "69958",
            birthday: " ",
            room: "5/2", 
            img: "1717150036738.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127019", 
            name: "นายกิตติทัต แกล้วกล้า", 
            nickname: "กานต์", 
            number: "69959",
            birthday: " ",
            room: "5/2", 
            img: "1716207690818.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127020", 
            name: "นายญาณพัฒน์ ศรีสวัสดิ์", 
            nickname: "แสตมป์", 
            number: "69960",
            birthday: " ",
            room: "5/2", 
            img: "1717150027407.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127021", 
            name: "นายณัฐณกร แสงจันทร์", 
            nickname: "นิค", 
            number: "69961",
            birthday: " ",
            room: "5/2", 
            img: "1717150032402.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127022", 
            name: "นายศุภณัฐ จันทร์รัตน์", 
            nickname: "เคนนี่", 
            number: "69964",
            birthday: " ",
            room: "5/2", 
            img: "1717150018900.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127023", 
            name: "นางสาวกีรติรัตน์ ปั้นเทียน", 
            nickname: "เกรซ", 
            number: "69966",
            birthday: " ",
            room: "5/2", 
            img: "1717150033289.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127024", 
            name: "นางสาวธัญญภัสส์ ศรีมี", 
            nickname: "พอเพียง", 
            number: "69967",
            birthday: " ",
            room: "5/2", 
            img: "1717150031564.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127025", 
            name: "นางสาวปภาดา นิลพงษ์", 
            nickname: "ปอนด์", 
            number: "69968",
            birthday: "16 มกราคม 2551",
            room: "5/2", 
            img: "1717150044899.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127026", 
            name: "นางสาวปภาดา บุญมีรัตน์", 
            nickname: "สายไหม", 
            number: "69969",
            birthday: "29 กรกฎาคม 2551",
            room: "5/2", 
            img: "1716207703599.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127027", 
            name: "นางสาวปวริสา จูเจี่ย", 
            nickname: "เนย", 
            number: "69970",
            birthday: "7 พฤศจิกายน 2551",
            room: "5/2", 
            img: "1717150020644.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127028", 
            name: "นางสาวปุณยาพร ทองกุม", 
            nickname: "ใบแก้ว", 
            number: "69971",
            birthday: "2 ธันวาคม 2551",
            room: "5/2", 
            img: "1717150034122.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127029", 
            name: "นางสาวปุณิกา โคปาลสูตร", 
            nickname: "ข้าวหอม", 
            number: "69972",
            birthday: " ",
            room: "5/2", 
            img: "1717150029085.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127030", 
            name: "นางสาวพชรพร ดวงสุวรรณกุล", 
            nickname: "เกรซ", 
            number: "69973",
            birthday: " ",
            room: "5/2", 
            img: "1717150030776.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        { 
            id: "127031", 
            name: "นางสาวพาสุข ภาคีรุณ", 
            nickname: "ใบพลู", 
            number: "69974",
            birthday: " ",
            room: "5/2", 
            img: "1717150041996.jpg", // ตรวจสอบว่ามีไฟล์ชื่อนี้ในโฟลเดอร์ "รูป" จริงๆ
            img2: ".jpg",
            msg: "coming soon" 
        },
        
        /* ข้อมูลรุ่น 127 */
    ]
};
